<?php

return [

    'custom' => [

        'name_en' => [
            'required' => 'الاسم بالانجليزية مطلوب',
            'string'   => 'الاسم بالانجليزية يجب أن يكون نص',
            'min'      => 'الاسم بالانجليزية يجب ألا يقل عن 2 حروف',
            'max'      => 'الاسم بالانجليزية يجب ألا يزيد عن 255 حرف',
            'regex'    => 'لاسم بالانجليزية يجب أن يحتوي  حروف ومسافات',
            'unique'   => 'هذا الاسم بالانجليزية موجود بالفعل',
        ],

        'name_ar' => [
            'required' => 'الاسم بالعربية مطلوب',
            'string'   => 'الاسم بالعربية يجب أن يكون نص',
            'min'      => 'الاسم بالعربية يجب ألا يقل عن 2 حروف',
            'max'      => 'الاسم بالعربية يجب ألا يزيد عن 255 حرف',
            'regex'    => 'الاسم بالعربية يجب أن يحتوي  حروف عربية ومسافات ',
            'unique'   => ' الاسم بالعربية موجود بالفعل',
        ],

        'added_date' => [
            'required'    => 'تاريخ الإضافة مطلوب',
            'date_format' => 'Y-m-d تاريخ الإضافة يجب أن يكون بالصيغة ',
        ],

        'type' => [
            'required' => 'النوع مطلوب',
            'in'       => 'النوع يجب أن يكون 1 أو 2',
        ],

        'room_property' => [
            'required' => 'خاصية الغرفة مطلوبة',
            'in'       => 'خاصية الغرفة يجب أن تكون  1, 2, 3',
        ],

        'image' => [
            'required' => 'الصورة مطلوبة',
            'mimes'    => '  png, jpg, jpeg الصورة يجب أن تكون من نوع ',
        ],

        'price' => [
            'required' => 'السعر مطلوب',
            'numeric'  => 'السعر يجب أن يكون رقم',
        ],

        'contractor_percentage' => [
            'required' => 'نسبة المقاول مطلوبة',
            'numeric'  => 'نسبة المقاول يجب أن تكون رقم',
            'between'  => 'نسبة المقاول يجب أن تكون بين 0 و 100',
        ],

        'room_zone_id' => [
            'required' => 'منطقة الغرفة مطلوبة',
            'exists'   =>  'منطقة الغرفة  غير صحيحة',
        ],

        'addition_id' => [
            'required' => 'الإضافة مطلوبة',
            'exists'   => 'الإضافة  غير صحيحة',
        ],

        'user_id' => [
            'required' => 'المستخدم مطلوب',
            'exists'   => 'المستخدم  غير صحيح',
        ],

        'contractor_id' => [
            'required' => 'المقاول مطلوب',
            'exists'   => 'المقاول  غير صحيح',
        ],

        'project_type_id' => [
            'required' => 'نوع المشروع مطلوب',
            'exists'   => 'نوع المشروع  غير صحيح',
        ],

        'name' => [
            'required' => 'اسم المشروع مطلوب',
            'min'      => 'اسم المشروع يجب ألا يقل عن 2 حروف',
            'max'      => 'اسم المشروع يجب ألا يزيد عن 50 حرف',
        ],

        'area' => [
            'required' => 'المساحة مطلوبة',
            'min'      => 'المساحة يجب أن تكون أكبر من 0',
        ],

        'budget_from' => [
            'required' => 'الميزانية الابتدائية مطلوبة',
            'numeric'  => 'الميزانية الابتدائية يجب أن تكون رقم',
            'min'      => 'الميزانية الابتدائية يجب أن تكون أكبر من 0',
        ],

        'budget_to' => [
            'required' => 'الميزانية النهائية مطلوبة',
            'numeric'  => 'الميزانية النهائية يجب أن تكون رقم',
            'gt'       => 'الميزانية النهائية يجب أن تكون أكبر من الميزانية الابتدائية',
        ],

        'open_budget' => [
            'boolean' => 'الميزانية المفتوحة يجب أن تكون 0 أو 1',
        ],

        'location' => [
            'required' => 'الموقع مطلوب',
            'min'      => 'الموقع يجب ألا يقل عن 2 حروف',
            'max'      => 'الموقع يجب ألا يزيد عن 100 حرف',
        ],

        'duration' => [
            'required' => 'مدة المشروع مطلوبة',
            'integer'  => 'مدة المشروع يجب أن تكون عدد صحيح',
        ],

        'start_date' => [
            'required'    => 'تاريخ بدء المشروع مطلوب',
            'date_format' => ' Y-m-d تاريخ بدء المشروع يجب أن يكون بالصيغة ',
            'after'       => 'تاريخ بدء المشروع يجب أن يكون بعد اليوم',
        ],

        'status' => [
            'required' => 'حالة المشروع مطلوبة',
            'integer'  => 'حالة المشروع يجب أن تكون رقم',
            'in'       => 'حالة المشروع يجب أن تكون 1',
        ],

        'project_id' => [
            'required' => 'المشروع مطلوب',
            'exists'   => 'المشروع  غير صحيح',
        ],

        'length' => [
            'required' => 'الطول مطلوب',
            'numeric'  => 'الطول يجب أن يكون رقم',
        ],

        'height' => [
            'required' => 'الارتفاع مطلوب',
            'numeric'  => 'الارتفاع يجب أن يكون رقم',
        ],

        'width' => [
            'required' => 'العرض مطلوب',
            'numeric'  => 'العرض يجب أن يكون رقم',
        ],

        'description' => [
            'required' => 'الوصف مطلوب',
            'string'   => 'الوصف يجب أن يكون نص',
            'min'      => 'الوصف يجب ألا يقل عن 2 حروف',
            'max'      => 'الوصف يجب ألا يزيد عن 500 حرف',
        ],

        'material_category_id' => [
            'required' => 'فئة المواد مطلوبة',
            'integer'  => 'فئة المواد يجب أن تكون رقم صحيح',
            'exists'   => 'فئة المواد  غير صحيحة',
        ],

        'project_room_id' => [
            'required' => 'غرفة المشروع مطلوبة',
            'integer'  => 'غرفة المشروع يجب أن تكون رقم صحيح',
            'exists'   => 'غرفة المشروع  غير صحيحة',
        ],

        'addition_type_id' => [
            'required' => 'نوع الإضافة مطلوب',
            'integer'  => 'نوع الإضافة يجب أن يكون رقم صحيح',
            'exists'   => 'نوع الإضافة  غير صحيحة',
        ],

        'amount' => [
            'required' => 'الكمية مطلوبة',
            'integer'  => 'الكمية يجب أن تكون رقم صحيح',
        ],

        'rate' => [
            'required' => 'التقييم مطلوب',
            'integer'  => 'التقييم يجب أن يكون رقم صحيح',
            'min'      => 'التقييم يجب ألا يقل عن 1',
            'max'      => 'التقييم يجب ألا يزيد عن 5',
        ],

        'cancel_reason' => [
            'required' => 'سبب الإلغاء مطلوب',
            'string'   => 'سبب الإلغاء يجب أن يكون نص',
            'min'      => 'سبب الإلغاء يجب ألا يقل عن 2 حروف',
            'max'      => 'سبب الإلغاء يجب ألا يزيد عن 50 حرف',
        ],
         'materials' => [
            'required' => 'حقل المواد مطلوب',
            'array'    => 'حقل المواد يجب أن يكون مصفوفة',
        ],
        'materials.floor' => [
            'required' => 'مطلوب اختيار مادة الأرضية',
            'exists'   => 'مادة الأرضية غير صحيحة',
        ],
        'materials.ceil' => [
            'required' => 'مطلوب اختيار مادة السقف',
            'exists'   => 'مادة السقف  غير صحيحة',
        ],
        'materials.wall' => [
            'required' => 'مطلوب اختيار مادة الحائط',
            'exists'   => 'مادة الحائط  غير صحيحة',
        ],

        'additions' => [
            'required' => 'حقل الإضافات مطلوب',
            'array'    => 'حقل الإضافات يجب أن يكون مصفوفة',
        ],
        'additions.*.addition_type_id' => [
            'required' => 'مطلوب اختيار نوع الإضافة',
            'exists'   => 'نوع الإضافة غير صحيح',
        ],
        'additions.*.amount' => [
            'required' => 'مطلوب إدخال الكمية',
            'numeric'  => 'الكمية يجب أن تكون رقم',
            'min'      => 'الكمية لا يمكن أن تقل عن 1',
        ],
    ],

    'attributes' => [
        'name_en' => 'الاسم بالانجليزية',
        'name_ar'  => 'الاسم بالعربية',
        'added_date'  => 'تاريخ الإضافة',
        'type'  => 'النوع',
        'room_property' => 'خاصية الغرفة',
        'image'  => 'الصورة',
        'price'  => 'السعر',
        'contractor_percentage' => 'نسبة المقاول',
        'room_zone_id'  => 'نوع الغرفة',
        'addition_id'   => 'قسم الإضافة ',
        'user_id'     => 'المستخدم',
        'contractor_id'    => 'المقاول',
        'project_type_id'  => 'نوع المشروع',
        'name'   => 'اسم المشروع',
        'area'   => 'المساحة',
        'budget_from'  => 'الميزانية الابتدائية',
        'budget_to'   => 'الميزانية النهائية',
        'open_budget'  => 'الميزانية المفتوحة',
        'location'   => 'الموقع',
        'duration'   => 'مدة المشروع',
        'start_date' => 'تاريخ بدء المشروع',
        'status'    => 'حالة المشروع',
        'project_id' => 'المشروع',
        'length'  => 'الطول',
        'height'  => 'الارتفاع',
        'width'   => 'العرض',
        'description'  => 'الوصف',
        'material_category_id'=> ' المواد',
        'project_room_id'  => 'غرفة المشروع',
        'addition_type_id' => 'نوع الإضافة',
        'amount'   => 'الكمية',
        'rate'   => 'التقييم',
        'cancel_reason' => 'سبب الإلغاء',
        'materials' => 'المواد',
        'materials.floor' => 'مادة الأرضية',
        'materials.ceil'  => 'مادة السقف',
        'materials.wall'  => 'مادة الحائط',
        'additions' => 'الإضافات',
        'additions.*.addition_type_id' => 'نوع الإضافة',
        'additions.*.amount' => 'الكمية',
     ],


];

